spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_17krCCFbpquSrt2NubaoVhCY
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer sk_test_C0Q8gFGxNZsXIpEvA4lsJJ7r
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"i686-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 3.13.0-39-generic (buildd@roseapple) (gcc version 4.8.2 (Ubuntu 4.8.2-19ubuntu1)
        ) #66-Ubuntu SMP Tue Oct 28 13:31:23 UTC 2014","hostname":"admin008"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 03 Mar 2016 10:53:49 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2030'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_80vxa6XqDIX0xG
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_17krCCFbpquSrt2NubaoVhCY",
          "object": "event",
          "api_version": "2015-10-16",
          "created": 1456991308,
          "data": {
            "object": {
              "id": "ch_17krCCFbpquSrt2NnoAR6ghn",
              "object": "charge",
              "amount": 999,
              "amount_refunded": 0,
              "application_fee": null,
              "balance_transaction": "txn_17krCCFbpquSrt2N71ySu5hV",
              "captured": true,
              "created": 1456991308,
              "currency": "usd",
              "customer": "cus_80sytRgtPY97DE",
              "description": null,
              "destination": null,
              "dispute": null,
              "failure_code": null,
              "failure_message": null,
              "fraud_details": {},
              "invoice": "in_17krCCFbpquSrt2NseiqIj5d",
              "livemode": false,
              "metadata": {},
              "order": null,
              "paid": true,
              "receipt_email": null,
              "receipt_number": null,
              "refunded": false,
              "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_17krCCFbpquSrt2NnoAR6ghn/refunds"
              },
              "shipping": null,
              "source": {
                "id": "card_17krC9FbpquSrt2Nn2ByeYY8",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_80sytRgtPY97DE",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 3,
                "exp_year": 2018,
                "fingerprint": "P2iXG4w2kPZzpxZL",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              },
              "source_transfer": null,
              "statement_descriptor": null,
              "status": "succeeded"
            }
          },
          "livemode": false,
          "pending_webhooks": 0,
          "request": "req_80sy3KX9MmuDiL",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Thu, 03 Mar 2016 10:53:49 GMT
recorded_with: VCR 3.0.1
